class user: #회원 객체 생성
    def __init__(self,name,id,pw,pp): #속성은 name~index순으로 이름, 이메일, 비밀번호, 프로필설명, 유저정보 딕셔너리, 타임라인 딕셔너리, 고유번호
        self.name=name
        self.id=id
        self.pw=pw
        self.pp=pp
        self.user={}
        self.tl={}
        self.index=1

    def create_user(self,id,pw,name,pp): #회원가입 메서드
        self.user[id]=[pw] #아이디를 key, 비밀번호가 포함된 리스트를 value로 갖는 딕셔너리 생성
        self.user[id]+=[name] #아이디 딕셔너리 value에 이름 추가
        self.user[id]+=[pp] #아이디 딕셔너리 value에 프로필설명 추가

    def remove_user(self): #회원탈퇴 메서드
        del self.user[uid]  #로그인한 id를 키로하는 유저정보를 유저정보 딕셔너리에서 삭제
        if self.tl!={}: #타임라인에 올라간 글이 있다면
            for i in range(1,len(self.tl)+1): #타임라인 글의 인덱스 처음부터 끝까지
                if self.tl[int(i)][7]==uid: #로그인한 id가 타임라인 글을 작성한 id와 일치한다면
                    del self.tl[int(i)] #삭제


    def update_user(self): #회원정보 수정 메서드
        print("{:>50}".format("< 회 원 정 보 수 정 >"))
        print("")
        print("{:>50}".format('1. 이름'))
        print("")
        print("{:>50}".format('2. 비밀번호'))
        print("")
        print("{:>50}".format('3. 프로필 설명'))
        print("")
        print('------------------------------------------------------------------------------------------------------------------------')
        print("{:>50}".format("선택 : "),end="")
        select=input()
        print('------------------------------------------------------------------------------------------------------------------------')
        if select=='1': #이름 변경
            print("{:>50}".format("새로운 이름 : "),end="")
            uname=input()
            self.user[uid][1]=uname

        elif select=='2':   #비밀번호 변경
            print("{:>50}".format("새로운 비밀번호 : "),end="")
            upw=input()
            self.user[uid][0]=upw
        else:   #프로필 설명 변경
            print("{:>50}".format("새로운 프로필 설명 : "),end="")
            upp=input()
            self.user[uid][2]=upp

    def input_timeline(self): #타임라인 글 입력 메서드
        print('------------------------------------------------------------------------------------------------------------------------')
        print("{:^100}".format('< 타임라인 글 작성 창 >'))
        print("")
        time=datetime.now() #작성 시간 불러오기
        print("")
        print("{:>20}".format('제목 : '),end='')
        title=input()
        print("")
        print("{:>20}".format('작성 내용 : '),end='')
        contents=input()
        print("")
        print("{:>13}".format(""), end="")
        tag=input('#').split()
        print("")
        like=0
        comment=[]
        lid=[]
        self.tl[self.index]=[self.user[uid][1],title,tag,like,contents,comment,time,uid,lid] #타임라인 글 딕셔너리에 작성자, 제목, 태그, 좋아요, 작성내용,
                                                                                                # 댓글, 작성 시간,로그인한 유저id ,좋아요 누른 유저id 입력
        self.index+=1 #글이 추가될 때마다 고유번호 +1

    def remove_timeline(self,index2): #타임라인 글 삭제 메서드
        del self.tl[int(index2)] #입력받은 index2를 고유번호로 갖는 타임라인 글 삭제

    def add_good_response(self,index3): #좋아요 추가 메서드
        if uid not in self.tl[int(index3)][8]: #게시글에 좋아요를 누르지 않았다면
            self.tl[int(index3)][8]+=[uid]
            self.tl[int(index3)][3]+=1 #입력받은 index3을 고유번호로 갖는 타임라인 글 좋아요 누르기
        else:
            print("{:>50}".format("이미 좋아요를 누르셨습니다."))

    def input_comment(self,index4,comment): #댓글 입력 메서드
        self.tl[int(index4)][5]+=[str(self.user[uid][1])+' : '+str(comment)] #입력받은 idex4를 고유번호로 갖는 타임라인 글에 댓글 입력하기


# 메뉴 화면 구성
from datetime import datetime #작성시간을 위한 datetime 가져오기
uid="" #로그인한 유저 아이디 디폴트값 설정
n=user("","","","") #유저 디폴트값 설정
yn='y' #로그아웃 여부 디폴트값 설정
while(yn=='y'):
    yn2='y' #회원탈퇴 여부 디플트값 설정
    while(yn2=='y'):
        rt='2'  #로그인 과정에서 초기화면 이동을 위한 값 설정
        while(rt=='2'):
            uyn='2' #회원여부에 따른 초기화면 이동을 위한 값 설정
            while(uyn=='2'):
                print('------------------------------------------------------------------------------------------------------------------------')
                print("{:^100}".format('< 메 뉴 >'))
                print("")
                print("{:>50}".format('회원이시면 로그인, 회원이 아니시면 회원가입을 선택해주세요.'))
                print("")
                print("{:>50}".format('1. 로그인'))
                print("")
                print("{:>50}".format('2. 회원가입'))
                print("")
                print("{:>50}".format('3. 종료'))
                print("")
                print('------------------------------------------------------------------------------------------------------------------------')
                print("{:>50}".format("선택 : "),end="")
                uyn=input()
                print('------------------------------------------------------------------------------------------------------------------------')

                #회원이 아닐 경우 회원가입에 필요한 정보 입력 받기
                if uyn=='2':
                    print("{:>50}".format('<회원가입>'))
                    print("")
                    print("{:>50}".format('이름을 입력해주세요 : '),end='')
                    nname=input()
                    print("")
                    print("{:>50}".format('아이디를 입력해주세요 : '),end='')
                    nid=input()
                    while(nid in n.user.keys()): #아이디를 키로 하므로 중복 불가 설정하기
                        print("")
                        print("{:>50}".format("-이미 존재하는 아이디입니다. 다시 입력해주세요.-"))
                        print("")
                        print("{:>50}".format('아이디를 입력해주세요 : '),end='')
                        nid=input()
                    print("")
                    print("{:>50}".format('비밀번호를 입력해주세요 : '),end='')
                    npw=input()
                    print("")
                    print("{:>50}".format('프로필 설명을 입력해주세요 : '),end='')
                    npp=input()
                    print("")
                    n.create_user(nid,npw,nname,npp) #새로운 회원 정보 추가
                    print('------------------------------------------------------------------------------------------------------------------------')
                    print("{:>50}".format('[%s님 회원가입을 축하드립니다. 초기화면으로 돌아갑니다.]') %nname)


            if uyn=='1': #회원인 경우 로그인하기
                upw=""
                rt='1' #로그인 재입력을 위한 디폴트값 설정
                while (rt=='1'):
                    print("{:>50}".format('< 로 그 인 >'))
                    print("")
                    print("{:>50}".format('아이디 : '),end='')
                    uid=input()
                    print("")
                    print("{:>50}".format('비밀번호 : '),end='')
                    upw=input()
                    print("")
                    print('------------------------------------------------------------------------------------------------------------------------')
                    if (uid in n.user.keys() and n.user[uid][0]==upw): #아이디와 비밀번호를 일치하게 입력시 로그인
                        rt='' #로그인에 성공했으므로 while에서 나가기
                        print("{:}".format('[%s님 환영합니다.]') %n.user[uid][1])
                        print('------------------------------------------------------------------------------------------------------------------------')
                        yn='n' #로그아웃 여부
                        yn2='n' #회원탈퇴 여부
                        while(yn!='y' and yn2!='y'): #로그아웃이나 회원탈퇴가 아닌 경우 다시 타임라인 목록으로 돌아오기
                            print("{:>50}".format("< 타 임 라 인 목 록 >"))
                            print('------------------------------------------------------------------------------------------------------------------------')

                            for i in range(1,len(n.tl)+1): #타임라인 딕셔너리를 이용해서 최근일자 순으로 타임라인 글 게시
                                print("{:>20}".format('고유번호 : '),end='')
                                print(list(n.tl.items())[len(n.tl)-i][0])
                                print("")
                                print("{:>20}".format('제목 : '),end='')
                                print(list(n.tl.items())[len(n.tl)-i][1][1])
                                print("")
                                print("{:>20}".format('작성자 : '),end='')
                                print(list(n.tl.items())[len(n.tl)-i][1][0])
                                print("")
                                print("{:>20}".format('작성날짜 : '),end='')
                                time=list(n.tl.items())[len(n.tl)-i][1][6]
                                print("%d년 %d월 %d일 %s요일 %02d:%02d:%02d" % (time.year, time.month, time.day, '월화수목금토일'[time.weekday()], time.hour, time.minute, time.second))
                                print("")
                                print("{:>20}".format('작성 내용 : '),end='')
                                print(list(n.tl.items())[len(n.tl)-i][1][4])
                                print("")
                                print("{:>13}".format(""), end="")
                                for j in list(n.tl.items())[len(n.tl)-i][1][2]:
                                    print('#%s' %j, end=" ")
                                print("")
                                print("")
                                print("{:>20}".format('<좋아요 수 : '),end='')
                                print(str(list(n.tl.items())[len(n.tl)-i][1][3])+'>')
                                print("")
                                print('**********')
                                print('< 댓 글 >')
                                for k in list(n.tl.items())[len(n.tl)-i][1][5]:
                                    print(k)
                                print('------------------------------------------------------------------------------------------------------------------------')

                            print("{:>50}".format("< 내 메 뉴 >"))
                            print("")
                            print("{:>50}".format("1. 타임라인 글 작성"))
                            print("")
                            print("{:>50}".format("2. 타임라인 글 삭제"))
                            print("")
                            print("{:>50}".format("3. 좋아요 추가"))
                            print("")
                            print("{:>50}".format("4. 댓글 입력"))
                            print("")
                            print("{:>50}".format("5. 다른 회원정보 보기"))
                            print("")
                            print("{:>50}".format("6. 회원정보 수정"))
                            print("")
                            print("{:>50}".format("7. 로그아웃"))
                            print("")
                            print("{:>50}".format("8. 회원탈퇴"))
                            print("")
                            print('------------------------------------------------------------------------------------------------------------------------')
                            print("{:>50}".format("선택 : "),end="")
                            select2=input()
                            if select2=='1':
                                n.input_timeline()
                                print("{:>50}".format("글 작성을 완료하였습니다. 타임라인으로 돌아갑니다."))
                                print('------------------------------------------------------------------------------------------------------------------------')
                            elif select2=='2':
                                print('------------------------------------------------------------------------------------------------------------------------')
                                print("{:>50}".format("삭제할 글의 고유번호를 입력해주세요."))
                                print("")
                                print("{:>50}".format("고유번호 : "),end="")
                                index2=input()
                                print("")
                                n.remove_timeline(index2)
                                print('------------------------------------------------------------------------------------------------------------------------')
                            elif select2=='3':
                                print('------------------------------------------------------------------------------------------------------------------------')
                                print("{:>50}".format("'좋아요'를 누를 글의 고유번호를 입력해주세요."))
                                print("")
                                print("{:>50}".format("고유번호 : "),end="")
                                index3=input()
                                print("")
                                n.add_good_response(index3)
                                if uid not in n.tl[int(index3)][8]: #게시글에 좋아요를 누르지 않았다면
                                    print("{:>50}".format("[%s번 글에 좋아요를 누르셨습니다.]" %index3))
                                print('------------------------------------------------------------------------------------------------------------------------')
                            elif select2=='4':
                                print('------------------------------------------------------------------------------------------------------------------------')
                                print("{:>50}".format("댓글을 입력할 글의 고유번호를 입력해주세요."))
                                print("")
                                print("{:>50}".format("고유번호 : "),end="")
                                index4=input()
                                print("")
                                print("{:>50}".format("댓글을 입력해주세요"))
                                print("")
                                print("{:>50}".format("댓글 : "),end="")
                                comment=input()
                                n.input_comment(index4,comment)
                                print('------------------------------------------------------------------------------------------------------------------------')
                            elif select2=='5':
                                print('------------------------------------------------------------------------------------------------------------------------')
                                print("{:>50}".format("정보를 열람할 회원의 아이디를 입력해주세요."))
                                print("")
                                print("{:>50}".format("아이디 : "),end="")
                                inid=input()
                                print("")
                                print('------------------------------------------------------------------------------------------------------------------------')
                                print("{:>50}".format("< 회 원 정 보 >"))
                                print("")
                                print("{:>50}".format("이름 : "),end="")
                                print(n.user[inid][1])
                                print("")
                                print("{:>50}".format("프로필 설명 : "),end="")
                                print(n.user[inid][2])
                                print("")
                                print("{:>50}".format("[개인정보 보호를 위해 제한적인 내용만 확인하실 수 있습니다.]"))
                                print('------------------------------------------------------------------------------------------------------------------------')

                            elif select2=='6':
                                print('------------------------------------------------------------------------------------------------------------------------')
                                n.update_user()
                                print('------------------------------------------------------------------------------------------------------------------------')

                            elif select2=='7':
                                print('------------------------------------------------------------------------------------------------------------------------')
                                print("{:>50}".format("로그아웃하시겠습니까?[y/n]"))
                                print("")
                                print("{:>50}".format("입력 : "), end="")
                                yn=input()
                                if yn=='n': #로그아웃하지 않을 경우 타임라인 목록으로 돌아가기
                                    select2='0'
                                print("")

                            elif select2=='8':
                                print('------------------------------------------------------------------------------------------------------------------------')
                                print("{:>50}".format("회원탈퇴시 저장된 정보가 모두 사라집니다. 정말 탈퇴하시겠습니까?[y/n]"))
                                print("")
                                print("{:>50}".format("입력 : "), end="")
                                yn2=input()
                                if yn2=='y':
                                    n.remove_user()
                                    print("")
                                    print("{:>50}".format("탈퇴되었습니다. 초기화면으로 돌아갑니다."))
                                    print("")
                                else: #회원탈퇴하지 않을 경우 타임라인 목록으로 돌아가기
                                    select2='0'
                                    print("")
                                    print('------------------------------------------------------------------------------------------------------------------------')

                    else:
                        print("{:>50}".format("<존재하지 않는 회원입니다.>"))
                        print("")
                        print("{:>50}".format("1. 재입력"))
                        print("")
                        print("{:>50}".format("2. 돌아가기"))
                        print("")
                        print("{:>50}".format("선택 : "),end="")
                        rt=input()
                        print('------------------------------------------------------------------------------------------------------------------------')

            else: #메뉴 선택지 3번과 그 외 종료
                yn='n'
                yn2='n'
                break

#1
print("{:>50}".format("<회 원 정 보 >"))
print('------------------------------------------------------------------------------------------------------------------------')
for i in n.user.items():
    print("{:>50}".format("이름 : "),end="")
    print(i[1][1])
    print("")
    print("{:>50}".format("아이디 : "),end="")
    print(i[0])
    print("")
    print("{:>50}".format("비밀번호 : "),end="")
    print(i[1][0])
    print("")
    print("{:>50}".format("프로필설명 : "),end="")
    print(i[1][2])
    print("")
    print('------------------------------------------------------------------------------------------------------------------------')
